{
  "generatedAt": "2026-01-22T05:02:54.779Z",
  "topic": "climate",
  "weekOf": "2026-01-22",
  "lead": "Recent developments in climate technology and policy highlight the intersection of innovation and environmental responsibility, from electric vehicles to real estate climate risk assessments.",
  "stories": [
    {
      "title": "Volvo’s EX60 Promises 400-mile Range in a More Competitive EV Climate",
      "link": "https://gizmodo.com/volvos-ex60-promises-400-mile-range-in-a-more-competitive-ev-climate-2000712520",
      "summary": "Volvo's new electric SUV, the EX60, aims to redefine the electric vehicle market with a promised range of 400 miles. Featuring advanced technology like HugInCore and Nvidia-powered infotainment, this vehicle is positioned to compete effectively in an increasingly crowded EV landscape. The EX60 reflects the automotive industry's shift towards sustainable transportation.",
      "source": "Gizmodo"
    },
    {
      "title": "Zillow removed climate risk scores. This climate expert is restoring them.",
      "link": "https://arstechnica.com/science/2026/01/zillow-removed-climate-risk-scores-this-climate-expert-is-restoring-them/",
      "summary": "In a controversial move, Zillow removed climate risk scores from its listings, prompting backlash from climate experts. A prominent climate researcher is now working to reinstate these scores to provide potential homebuyers with crucial information regarding climate-related risks. This initiative highlights the importance of transparency in real estate amid growing climate concerns.",
      "source": "Ars Technica"
    },
    {
      "title": "Berlin’s Cloover secures over $1.2 Billion to build the “Shopify of Energy”",
      "link": "https://thenextweb.com/news/berlins-cloover-secures-over-1-2-billion-to-build-the-shopify-of-energy",
      "summary": "Cloover, a Berlin-based climate fintech, has raised over $1.2 billion to develop a platform aimed at revolutionizing the energy sector. This funding includes significant equity and a substantial debt facility, which will be used to enhance their software and financing solutions for energy transition. Cloover's initiative represents a significant step towards integrating technology with sustainable energy practices.",
      "source": "The Next Web"
    }
  ]
}