{
  "generatedAt": "2026-01-21T22:47:37.606Z",
  "topic": "climate",
  "weekOf": "2026-01-21",
  "lead": "Recent developments in climate technology and policy highlight the growing intersection of innovation, finance, and environmental awareness.",
  "stories": [
    {
      "title": "Volvo’s EX60 Promises 400-mile Range in a More Competitive EV Climate",
      "link": "https://gizmodo.com/volvos-ex60-promises-400-mile-range-in-a-more-competitive-ev-climate-2000712520",
      "summary": "Volvo has unveiled its new EX60 electric SUV, which boasts an impressive 400-mile range, positioning it competitively in the evolving electric vehicle market. The vehicle features advanced technology, including integrated AI and Nvidia-powered infotainment systems, emphasizing Volvo's commitment to innovation in the EV sector. This launch comes at a time when the demand for sustainable transportation solutions is at an all-time high.",
      "source": "Gizmodo"
    },
    {
      "title": "Zillow removed climate risk scores. This climate expert is restoring them.",
      "link": "https://arstechnica.com/science/2026/01/zillow-removed-climate-risk-scores-this-climate-expert-is-restoring-them/",
      "summary": "Zillow's recent decision to remove climate risk scores from its listings has sparked controversy, prompting a climate expert to take action to restore these critical data points. The removal was influenced by pressure from real estate brokers in California, raising concerns about transparency in the housing market. The restoration of these scores aims to provide potential buyers with essential information regarding climate-related risks.",
      "source": "Ars Technica"
    },
    {
      "title": "Berlin’s Cloover secures over $1.2 Billion to build the “Shopify of Energy”",
      "link": "https://thenextweb.com/news/berlins-cloover-secures-over-1-2-billion-to-build-the-shopify-of-energy",
      "summary": "Cloover, a Berlin-based climate fintech, has raised over $1.2 billion to enhance its platform aimed at transforming the energy sector. The funding includes a substantial debt facility and Series A equity, which will be used to expand their software and financing solutions across Europe. This significant investment reflects the growing interest in innovative financial solutions that support the transition to sustainable energy.",
      "source": "The Next Web"
    }
  ]
}