{
  "generatedAt": "2026-02-09T06:16:09.740Z",
  "topic": "education",
  "weekOf": "2026-02-09",
  "lead": "Exploring organizations dedicated to supporting Black professionals in the tech industry and promoting diversity in education and employment.",
  "stories": [
    {
      "title": "10 professional organizations for Black IT pros",
      "link": "https://www.cio.com/article/191321/10-professional-organizations-for-black-it-pros.html",
      "summary": "The tech industry continues to struggle with diversity, particularly for Black professionals who hold a mere 7% of tech jobs. This article highlights ten organizations that are crucial in supporting Black IT and tech professionals through scholarships, networking, and career development opportunities. These organizations aim to address systemic inequities and create pathways for Black students into STEM fields.",
      "source": "CIO"
    },
    {
      "title": "Blacks in Technology: Closing the Divide",
      "link": "https://www.techcrunch.com/2026/01/15/blacks-in-technology-closing-the-divide/",
      "summary": "Blacks in Technology (BIT) is a nonprofit organization focused on leveling the playing field for Black tech workers through education and mentorship. With chapters across the globe, BIT provides resources and networking opportunities aimed at enhancing career growth and representation in the tech industry. The organization emphasizes the importance of allyship in fostering an inclusive environment.",
      "source": "TechCrunch"
    },
    {
      "title": "DevColor: A Career Accelerator for Black Software Engineers",
      "link": "https://www.devcolor.org",
      "summary": "DevColor is dedicated to supporting Black software engineers and technologists by providing career development and accountability resources. Their unique programs, such as the A* program, foster community and professional growth among participants. This initiative aims to create a robust network of Black leaders in IT, enhancing representation at all levels.",
      "source": "DevColor"
    },
    {
      "title": "National Society of Black Engineers: Empowering Future Leaders",
      "link": "https://www.nsbe.org",
      "summary": "The National Society of Black Engineers (NSBE) is a vital organization for Black students and professionals in engineering and tech. With nearly 16,000 active members, NSBE focuses on increasing the number of culturally responsible Black engineers and providing them with the tools to excel academically and professionally. Their community initiatives positively impact both members and the broader community.",
      "source": "NSBE"
    },
    {
      "title": "Black Tech Pipeline: Connecting Talent with Opportunity",
      "link": "https://www.blacktechpipeline.com",
      "summary": "Founded by Pariss Chandler, Black Tech Pipeline connects Black technologists with job opportunities and addresses retention issues within the tech industry. By offering consulting services and support during the critical early months of employment, the organization aims to demonstrate the availability of skilled Black professionals eager to contribute to diverse workplaces.",
      "source": "TechCrunch"
    },
    {
      "title": "Blacks United in Leading Technology: A Focus on Community",
      "link": "https://www.built.org",
      "summary": "Blacks United in Leading Technology (BUiLT) is a nonprofit that emphasizes community engagement and professional development for Black tech workers. With chapters across the U.S., BUiLT offers training, mentorship, and networking opportunities to enhance representation in the tech industry. Their commitment to equity is reflected in their diverse programming and community-focused initiatives.",
      "source": "BUiLT"
    },
    {
      "title": "Information Technology Senior Management Forum: Advancing Black Professionals",
      "link": "https://www.itsmf.org",
      "summary": "The Information Technology Senior Management Forum (ITSMF) is dedicated to increasing the representation of Black professionals in senior tech roles. Established by tech executives, ITSMF offers programs aimed at career advancement and innovation within organizations. Their initiatives focus on empowering Black leaders to influence the tech industry positively.",
      "source": "ITSMF"
    },
    {
      "title": "We Build Black: Fostering Community Among Black Developers",
      "link": "https://www.webuildblack.org",
      "summary": "We Build Black is a nonprofit organization that emerged from a need for community among Black software engineers. Founded by Devin Jackson, the organization hosts events and coding programs aimed at connecting Black developers and enhancing their career opportunities. Their annual conferences and outreach initiatives seek to uplift the Black tech community.",
      "source": "We Build Black"
    }
  ]
}